Revit 2027 API
ParameterTypeId.StairsSupporttypeStructuralDepth Property
 "Structural Depth": Structural Depth
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsSupporttypeStructuralDepth { get; }
Public Shared ReadOnly Property StairsSupporttypeStructuralDepth As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsSupporttypeStructuralDepth {
	ForgeTypeId^ get ();
}
static member StairsSupporttypeStructuralDepth : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace